# Import Dependncies

In [1]:
import numpy as np
import pandas as pd
import tensorflow as tf
from tensorflow import keras
import matplotlib.pyplot as plt

# Task1: Solving A Problem using RNNs

In [2]:
data = pd.read_csv("GOOG.csv", date_parser=True)

In [3]:
data.head()

         Date      Open      High       Low     Close  Adj Close     Volume
0  2004-08-20  2.515820  2.716817  2.503118  2.697639   2.697639  458857488
1  2004-08-23  2.758411  2.826406  2.716070  2.724787   2.724787  366857939
2  2004-08-24  2.770615  2.779581  2.579581  2.611960   2.611960  306396159
3  2004-08-25  2.614201  2.689918  2.587302  2.640104   2.640104  184645512
4  2004-08-26  2.613952  2.688672  2.606729  2.687676   2.687676  142572401

In [5]:
data.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
4555,2022-09-23,100.059998,100.110001,98.010002,99.169998,99.169998,25645100
4556,2022-09-26,98.610001,100.440002,98.379997,98.809998,98.809998,22437900
4557,2022-09-27,99.910004,100.459999,97.339996,98.089996,98.089996,24225000
4558,2022-09-28,98.019997,101.400002,97.800003,100.739998,100.739998,24617000
4559,2022-09-29,99.300003,99.300003,96.519997,98.089996,98.089996,21921500

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4560 entries, 0 to 4559
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       4560 non-null   object
 1   Open       4560 non-null   float64
 2   High       4560 non-null   float64
 3   Low        4560 non-null   float64
 4   Close      4560 non-null   float64
 5   Adj Close  4560 non-null   float64
 6   Volume     4560 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 249.5+ KB